[
  {
    "title": "Understanding blogs – Tracy Durnell's Mind Garden",
    "url": "https://tracydurnell.com/2023/01/15/understanding-blogs/",
    "content": "As we in the IndieWeb promote personal websites and encourage more people to write and publish online, and nostalgia for blogs and RSS is high, it’s useful to hone in on what exactly we’re talking about when we say blog.* Because, despite being a form of writing for more than 20 years, blogging is surprisingly hard to pin down.**\nThere are just a few truly defining characteristics of a blog:\nAnd yet, I think what makes a blog a blog is more than these technicalities; what makes a book a book is not merely “prose text, more than 50,000 words in length, on a single thesis or theme, collected in a single volume.” Printing off a long blog and binding it together does not necessarily a book make; for one, books are weighted towards linear reading — start to finish — while blog posts do not have to be read in the order they were originally published.\nThere are elements of bookness that make us say, this is a book. So what is blogness? From one of the many ‘yay let’s blog again’ posts everyone’s blogging about right now (which I enjoy), I wound up on a 2003 post trying to define what a blog is — but it addresses mainly the technical elements and the structure of the content. Blogging as a medium evolved out of the combination of technology and tools used; here, I’m interested in digging into how the writing and format are different from other mediums.\nI’m a fan of graphic novels, and consider them a different medium than prose books; it pisses me off that graphic novels and graphic non-fiction are shelved with the comic strips at my library under 741.5. So I wonder: are blogs a distinct enough format to be their own top-level medium, or are they simply a hypertextual version of essay collections or newspapers?*** Where would you shelve blogs in the library: do they get mixed in with the books by topic, do they get their own call number as graphic novels do, are they thrown in with the periodicals, or do they go in their own section? @DavidShanske I’m sure you have an opini"
  },
  {
    "title": "Rebecca Blood :: Weblogs: A History And Perspective",
    "url": "http://www.rebeccablood.net/essays/weblog_history.html",
    "content": "In 1998 there were just a handful of sites of the type that are now identified as weblogs (so named by Jorn Barger in December 1997). Jesse James Garrett, editor of Infosift, began compiling a list of \"other sites like his\" as he found them in his travels around the web. In November of that year, he sent that list to Cameron Barrett. Cameron published the list on Camworld, and others maintaining similar sites began sending their URLs to him for inclusion on the list. Jesse's 'page of only weblogs' lists the 23 known to be in existence at the beginning of 1999.\nSuddenly a community sprang up. It was easy to read all of the weblogs on Cameron's list, and most interested people did. Peter Merholz announced in early 1999 that he was going to pronounce it 'wee-blog' and inevitably this was shortened to 'blog' with the weblog editor referred to as a 'blogger.'\nAt this point, the bandwagon jumping began. More and more people began publishing their own weblogs. I began mine in April of 1999. Suddenly it became difficult to read every weblog every day, or even to keep track of all the new ones that were appearing. Cameron's list grew so large that he began including only weblogs he actually followed himself. Other webloggers did the same. In early 1999 Brigitte Eaton compiled a list of every weblog she knew about and created the Eatonweb Portal. Brig evaluated all submissions by a simple criterion: that the site consist of dated entries. Webloggers debated what was and what was not a weblog, but since the Eatonweb Portal was the most complete listing of weblogs available, Brig's inclusive definition prevailed.\nThis rapid growth continued steadily until July 1999 when Pitas, the first free build-your-own-weblog tool launched, and suddenly there were hundreds.  In August, Pyra  released Blogger, and Groksoup launched, and with the ease that these web-based tools provided, the bandwagon-jumping turned into an explosion. Late in 1999 software developer Dave Winer introduced Edit"
  },
  {
    "title": "Rubenerd: Macroblogging",
    "url": "https://rubenerd.com/macroblogging/",
    "content": "People are scrambling for alternatives with the downfall of Twitter. The service pioneered the concept of brief, concise posts which every other social network soon copied. In a world of short attention spans and instant gratification, the format seemed all but inevitable.\nOut of this spawned a new type of writing, dubbed microblogging. Like Twitter, they consist of short posts without titles, or much metadata at all beyond a date. There are a few indie services offering these, or in a pinch you can turn a blog like WordPress into one.\nBut the phrase microblog implies the existence of a macroblog, and that’s what I miss the most. Back when people used to write more than a sentence or two about their day, the flowers they saw, the problems the solved, the people they talked with, the places they travelled.\nThis is why I’ve started writing more about my travels and life of late, because its what I miss seeing from other people. It used to be that you could subscribe to your friends’ blogs and see what they were up to. Now we only get fragments on a social network that will end up deleting them.\nMicroblogs have their place, but they make me a bit melancholic. It’s time to bring back the macroblog!\nI'm Ruben Schade, a technical writer and IaaS engineer in Australia. Hi! You can shout me a coffee or send a comment here. Thanks for reading.\n\nNewer post ← The Sun SPARCStation 5’s 13W3 connector\nOlder post → What colour is the Commodore 64?\n"
  },
  {
    "title": "The Evolution of Blogging - The History of the Web",
    "url": "https://thehistoryoftheweb.com/the-evolution-of-blogging/",
    "content": "Written by Jay on August 14, 2017.\nBy 2001, the world blog had entered Internet vernacular, both as a noun and a verb. Mena Trott was one of these bloggers. Her site, A Dollar Short, went up in April of 2001. With the launch of her site, Trott aimed big. She loved blogging, and she aspired to be one of the best. So she set her sights on winning the SXSW weblog award and, at the end of 2002, she did just that. Which, incidentally, was right around the time that she was changing the blogging world forever.\nJust a few years before that, things were a lot different. The term blog can be traced back to around 1997, when Jorn Barger launched his website, titling it “The Robot Wisdom Weblog.” Barger’s plan was to curate his favorite links from around the web, and add bits of commentary to each one. In other words, he meant to keep a log of his web experience. Hence weblog.\nPretty soon other weblogs started sprouting up. In their earliest days, webloggers stood as gatekeepers to the web’s ever-growing well of content. Each day, these URL pioneers would post a few new links and sprinkle in their own commentary. Blogs acted as a signpost for web users, and following a few key blogs was enough to keep track of just about everything new on the web. Many began to look at the blogging community as a brand new type of media, one that often stood far closer to an impartial truth than traditional mediums would allow for. It wasn’t long until there were even weblog sites focused on helping its visitors keep track of other weblog’s, such as Brigitte Eaton’s EatonWeb Portal.\nThen, in 1999, Peter Merholz threw up his own weblog, and in the sidebar added the tagline:\nI’ve decided to pronounce the word “weblog” as wee’- blog. Or “blog” for short.\nAnd from what was more or less a throwaway joke, we got the word blog.\nIn the beginning, most bloggers hand coded their sites, adding a new HTML page to their server each time they had a new entry, or just updating the homepage to include the new"
  },
  {
    "title": "Yordi - A Lifelong Journey of Growth",
    "url": "https://xn--sr8hvo.ws/random",
    "content": "Robert recently wrote about the American songwriter and producer Desmond Child, who used one of his musical creations in multiple songs. A creative way of recyling material by making little changes, so that it magically fits in new pieces.\nIt reminded me of a text I have used and re-used on multiple ocassions, most recently in this piece in the context of the June 2025-edition of the IndieWeb Carnival. The original piece, which I wrote back in 2018, features a life-changing question a friend asked me on a trip to Nice, France, which eventually led to my current career as a computer science- and software development teacher.\nSince publishing the original I have used the basis of this text as the underlying written story for multiple job application cover letters: three times for a position at a secondary school and once at an applied university.\nI got accepted in the position every time.\nReusing a piece of content multiple times after creating it once is nothing new. Live performers like actors or singers do it all the time: a theatrical piece is written once and performed dozens, even hundreds of times. A band plays the same setlist in concerts halls all over the world.\nIt's just the concept of textual content like blog posts, for which this feels a little more weird and unusual. But in the end, it is exactly the same.\nRandom post: the post will show here when it's loaded.\nLast played: the song will show here when it's loaded.\nCurrently reading: the book will show here when it's loaded.\n\n\n\n\n\n\n                    Jun 22, 2025\n                \n\n\nMy Greatest Writing Hit\n\n\n\n\n\n                    Jun 22, 2025\n                \n\n\nHuman vs. Machine: The Soul Behind the Story\n\n\n\n\n\n                    Jun 13, 2025\n                \n\n\nStep-by-Step Guide: Posts by Month in Bear Blog\n\n\n\n\n\n                    Jun 9, 2025\n                \n\n\nRemembering the Story\n\n\n\n\n\n                    Jun 8, 2025\n                \n\n\nMagic Umbrellas and Quiet Goodbyes: Lessons from Mary Poppins\n\n\n\n"
  },
  {
    "title": "Why I Blog. You Should Too!",
    "url": "https://shellsharks.com/you-should-blog",
    "content": "You should start a blog. If you disagree, I certainly understand the hesitancy. I was once like you! I’m here to convince you otherwise. I’ll start with a short tale about the inception of shellsharks and the unsuccessful blogging attempts which preceded it.Historical ContextI started the shellsharks site in mid-2019. At that time, I had but two ideas for topics to write about - a “Getting Into Infosec” guide and an idea to catalog all of the “named” vulnerabilities (e.g. “Heartbleed”). Prior to 2019, I tried at least two other times to blog or otherwise “write”, both of which fizzled out before I got to a second post. At the time, I blamed this on the usual reasons - not enough time, didn’t know what to write about, couldn’t find my “niche”, etc… What I failed to realize then are a number of things I fully appreciate today, and I’d like to share those with you. Let me start with what not to worry about when starting a blog…What Not To Worry AboutIn this section is a list of common concerns & fears people have when faced with the thought of starting a blog. Many of these slowed me down in the beginning but I am here to tell you, don’t worry about it!I don’t know how to host a blog : This is an easy fix and it is only a Google search away! You have plenty of options too, with varying degrees of complexity. Sites like Medium can make it easy to get started, WordPress is incredibly popular and has plenty of advanced functionality as well as for-beginners templates and tutorials, and GitHub Pages (which I personally use) can help you host a blog directly out of a GitHub account! There are countless other means too. The important takeaway is that it is easy to start, you need only contend with overchoice.I don’t know which blog hosting provider is best : This is a classic road block. You know you want to start a blog but get bogged down in picking the best hosting provider or the best of whatever else. Don’t sweat this too much. Do a little research and pick one that fit"
  },
  {
    "title": "MediaWiki",
    "url": "https://www.mediawiki.org/",
    "content": "The MediaWiki software is used by tens of thousands of websites and thousands of companies and organisations.\nIt powers Wikipedia and also this website.\nMediaWiki helps you collect and organise knowledge and make it available to people.\nIt's powerful, multilingual, free and open, extensible, customisable, reliable, and free of charge.\nFind out more and if MediaWiki is right for you.\n"
  },
  {
    "title": "Quietism • tommorris.org",
    "url": "https://tommorris.org/posts/2018/quietism/",
    "content": "\n      © 2025 Tom Morris\n      \n    \nIf you are reading this, I have a new personal site.\nMy previous site was down for a very long time:\ninitially, the server had gone down because log files had grown too large and\nI hadn’t set up a proper log rotation system that discarded the old log files.\nThen I tried to upgrade the server, because the OS was massively out-of-date\n(thus opening up possible security vulnerabilities), and in the process I\nbroke it. Or it broke. The upgrade from Ubuntu 17.10 to 18.04 didn’t take.\nI managed to recover the old server long enough to log in and get the important\nstuff: the actual content. Then I thought: better start afresh. New server,\ninstalled from scratch, set up the blog app I’d written, import the old content,\nand we’re back in business.\nBut I didn’t. To do it properly, I’d need to write some kind of automated\nsetup script, either a bunch of shell scripts, something involving Docker\nor something like Ansible.\nWay too much effort for a personal blog.\nDevOps is one thing, but BlogOps? I refuse.\nEven if I were to do so, I would be in the same bind: in a year or two,\nI’d have to upgrade it all again, and that would require time and effort.\nAlternatively, I could host it on Heroku, but to make that work properly, you\nhave to pay money. Or maybe on Google Cloud Platform, or Azure. More technology\nto learn. No thanks.\nInstead, I settled on using Hugo and\nNetlify. My friend Dan\nhad told me about Netlify recently—I had heard of it, but hadn’t really tried it.\nIt is basically Heroku but for static sites. GitHub Pages, but with a bunch of\nuseful stuff thrown in, including Let’s Encrypt.\nWhy Hugo? Because it exists and is reasonably well maintained. Frankly, I don’t\nknow Go, but it looks reasonably straightforward to learn enough if I need to\nmeddle in the innards of the thing—which I have no intention to unless necessary.\nI grabbed the nicest looking Hugo theme, and got it up on Netlify within about\n15 minutes. I don’t need to administer a"
  },
  {
    "title": "Deed - CC0 1.0 Universal\n - Creative Commons",
    "url": "http://creativecommons.org/publicdomain/zero/1.0/",
    "content": "\n        Join a  global community working to strengthen the Commons\n       \n\n        Become an expert in creating and engaging with openly licensed materials\n       \n\n        Attend our annual event, promoting the power of open licensing\n       \n\n        Get help choosing the appropriate license for your work\n       \n\n        Find engines to search openly licensed material for creative and educational reuse\n       \n\n        Help us build products that maximize creativity and innovation\n       \n\n      The Commons Deed is not a legal instrument. It is simply a handy reference for understanding the CC0 Legal Code, a human-readable expression of some of its key terms. Think of it as the user-friendly interface to the CC0 Legal Code beneath. This Deed itself has no legal value, and its contents do not appear in CC0.\n     \n\n      Creative Commons is not a law firm and does not provide legal services. Distributing, displaying, or linking to this Commons Deed does not create an attorney-client relationship.\n     \n\n      Creative Commons has not verified the copyright status of any work to which CC0 has been applied. CC makes no warranties about any work or its copyright status in any jurisdiction, and disclaims all liability for all uses of any work.\n     \n\n      Creative Commons is the nonprofit behind the open licenses and other legal tools that allow creators to share their work. Our legal tools are free to use.\n     \n\n     Creative Commons  PO Box 1866, Mountain View, CA 94042\n    \n\n\n      info@creativecommons.org\n     \n\n\n     Our work relies on you! Help us keep the Internet free and open.\n    \n\n     Except where otherwise\n     \n      noted\n     \n     , content on this site is licensed under a\n     \n      Creative Commons Attribution 4.0 International license\n     \n     . Icons by\n     \n      Font Awesome\n     \n     .\n    "
  },
  {
    "title": "Welcome to Pinboard—Social bookmarking for introverts!",
    "url": "http://pinboard.in",
    "content": "Social Bookmarking for Introverts\nFounded in 2009, Pinboard is a fast, independently run, no-nonsense bookmarking site for people who value privacy and speed.\nThere are no ads and no trackers of any kind. Users pay a modest yearly fee. \n\nThere are no ads and no trackers of any kind. Users pay a modest yearly fee. \n\nPinboard lets you bookmark from any browser, connect up Twitter accounts (and favorites), and sync with popular services like Instapaper or Pocket.\nFor a few more bucks a year, Pinboard offers an archiving service which saves a copy of everything you bookmark, gives you full-text search, and automatically checks your account for dead links.\nTake a quick tour of the site to see if it's right for you!\n    \n\n       \n       \n    \nFor a few more bucks a year, Pinboard offers an archiving service which saves a copy of everything you bookmark, gives you full-text search, and automatically checks your account for dead links.\nTake a quick tour of the site to see if it's right for you!\n    \n\n       \n       \n    \nTake a quick tour of the site to see if it's right for you!\n    \n\n       \n       \n    \n“A one-man operation can compete against million dollar corporations and thrive.”\n“Pinboard is a very effective service… Sometimes, you don't need glitz; you need plumbing.”\n“A clever bookmarking service that lets you organize links […] and even cache copies of entire web pages.”\n“One dude in his underpants somewhere who has five windows open to terminal servers.”"
  },
  {
    "title": "Q: Why Blog? A: Blogs Are Great. – Disquiet",
    "url": "https://disquiet.com/2021/04/10/q-why-blog-a-blogs-are-great/",
    "content": "This is my occasional request that if you (1) have a focused interest and (2) post regularly about it on social media, then please start a blog. Please read both points again before proceeding. And, no, I’m not saying cease social media. I’m saying your thoughts deserve their own plot of virtual land. [Starry skies above, and all that](https://www.youtube.com/watch?v=vMnLoOnrwbg).\nI had fun this past week [on Twitter](https://twitter.com/disquiet/status/1380354467887865859), resulting in a long thread on why blogs are great. I’m repurposing much of it here, lightly edited, so it’s in one place, true to my sense that Twitter is best as a public notebook.\nDon’t sweat the digital undercarriage. Don’t worry about if you should use [WordPress](https://wordpress.com/), or [SquareSpace](https://www.squarespace.com/), or [a whole new internet protocol](https://gemini.circumlunar.space/) I don’t myself understand, or some other service. Just choose one for now and start a blog. You can always output your blog’s content at a later date and upload it into a new service down the road. I’ve seen plenty of people get so focused on tweaking their CMS (content management system) that they never actually get around to publishing.\nI’ve written something along these lines before, which I collated in a post titled [“Bring Out Your Blogs”](https://disquiet.com/2019/06/16/word-blog-20th-anniversary-1999/) back in 2019, which marked the 20th anniversary of the word “blog.” The main points are simple: \n1. Have a topic focus\n2. Try to post at least once a week\n3. If you use social media, treat it as your public notebook\n4. Write for yourself first and foremost\nAnd to be clear, I’m not just talking about or to folks who are focused on sound or music. Those just happen to be my interest. Start a blog whatever may be your yum: knitting, regional history, arcane professional expertise. (Though, should you ponder, in your writing, some sonic aspect of your topic, please do let me know.)\nAnd plea"
  },
  {
    "title": "Knock Knock WHOIS There – .blog domains – for all the ways you share",
    "url": "https://my.blog",
    "content": "No matter what you create or why, a .blog domain is the insignia of bloggers—a space for your creativity, to elevate your voice, and to celebrate your story in all its brilliance.\nDiscover the ultimate tool for personal and business growth that allows you to showcase your expertise and connect with like-minded individuals. Elevate your brand and establish your authority by tapping into the transformative force of blogging.\nFrom thought leaders and creatives to adventurous travelers and passionate storytellers, dotbloggers encompass a spectrum of perspectives and experiences. Each .blog domain weaves a narrative that reflects the individuality and creativity of its owner. Explore the dynamic community of dotbloggers and be inspired by their stories, insights, and passions.\nBlogs have grown from simple online diaries into the content that fuels the Internet. But no matter what you create — or why you create it — own what you create by putting it on your domain."
  }
]